//错误处理
let errorcodes={
  10000001:'返回数据格式错误',
  10010001:'路由错误',
  10020002:'用户账户不存在',
  10020003:'用户密码错误',
  10020004:'token错误',
  10020005:'用户已存在',
  10020006:'注册失败',
  10020007:'登录失败',
  10020008:'游戏服不存在',
  10020009:'今日救济金已领取完毕',
  10020044:'救济金领取失败',
  10020048:'定位失败',
  10020049:'玩家修改的性别参数错误',
  10020050:'缺少参数',
  10020051:'消息入队列失败',
  10020052:'房间内没人或者都未准备',
  10020053:'用户身份证号码错误',
  10020054:'用户身份证号码登记失败',
  10020055:'用户性别修改失败',
  10020056:'个性签名长度过长',
  10020057:'个性签名修改失败',
  10030010:'房间已满,请重新匹配',
  10030011:'游戏已结束',
  10030012:'金币不足,请购买金币',
  10030013:'金币场验证失败',
  10030014:'房卡不足',
  10030015:'匹配失败',
  10030016:'房间已过期',
  10030017:'不在房间中',
  10030018:'牌局记录创建失败',
  10030019:'房间已过期，结算失败',
  10030020:'你有牌局未恢复',
  10030021:'你有房间未解散',
  10030022:'创建房间异常',
  10030023:'房间已解散',
  10030024:'需解散房间',
  10030025:'非房主无法解散房间',
  10030026:'游戏进行中不能解散房间',
  10030027:'未找到房间用户信息',
  10030028:'非房主无权恢复房间',
  10030029:'游戏已开始',
  10030030:'未发现房间配置',
  10030031:'房间不存在',
  10030032:'房间场次已结束',
  10030039:'未进入游戏',
  10030040:'游戏已开始或已经准备',
  10030041:'已在房间中',
  10030042:'未找到房间信息',
  10030043:'游戏未开始',
  10030045:'房间准备失败',
  10030046:'游戏不存在',
  10030047:'底注类型不存在',
  10030049:'离开房间失败',
  10030050:'结束牌局失败',
  10030051:'创建房卡房间校验失败',
  10030052:'创建房卡房间失败',
  10030053:'房卡房间不走此接口',
  10030054:'没通过匹配验证标志',
  10030055:'房间已满,请重新选择房间',
  10030056:'查询不到房间规则',
  10040033:'创建订单失败',
  10040034:'订单不存在',
  10040035:'订单过期',
  10040036:'钻石不足',
  10040037:'商品不存在',
  10040038:'商品类型错误',
  10050001:'获取邮件的类型参数错误',
  10050002:'一键阅读邮件失败',
  10050003:'一键领取邮件附件失败',
  10050004:'获取邮件详情失败',
  10050005:'领取邮件详情中附件失败',
  10060001:'创建俱乐部失败',
  10060002:'已经创建过俱乐部',
  10060003:'已加入的俱乐部数量已达上限',
  10060004:'俱乐部重名',
  10060005:'俱乐部名字为空',
  10060006:'俱乐部名存在特设字符',
  10060007:'俱乐部名存在敏感词',
  10060008:'俱乐部成员已达上限',
  10060009:'已经加入过指定俱乐部',
  10060010:'重复申请加入俱乐部',
  10060011:'申请加入俱乐部失败',
  10060012:'拒绝申请失败',
  10060013:'添加用户到黑名单失败',
  10060014:'添加用户到俱乐部失败',
  10060015:'俱乐部不存在',
  10060016:'用户在黑名单内',
  10060017:'没有解散俱乐部权限',
  10060018:'解散俱乐部失败',
  10060019:'没有通过申请的权限',
  20010001:'token无效',
  20010002:'服务器维护中',
  20010003:'token过期',
  20010004:'重复登录',
  20030018:'未经验证,非法进入房间',
}
var err_finishwaterfall=1999
export default class NetCode{ 
	private static _instance = null;
	public static getInstance() : NetCode{
        if (NetCode._instance == null){
            NetCode._instance = new NetCode();
        }
        return NetCode._instance;
    }
	check(code){
		//中断waterfall不算错误
		if (code==err_finishwaterfall){ 
			return null;
		}
		if(code){
			if (code==0){ 
				return null
			}
			var errstr=errorcodes[code];
			var msgstr='错误码=' + code;
			if (errstr){
				msgstr=errstr; 
			}
			return msgstr;
		}
		return null;
	}
}